{
  "metadata": {
    "domain": "example.com"
  },
  "components": [
    {
      "name": "banner",
      "props": {
        "heading": "Story",
        "text": "A (modular, highly tweakable) responsive one-page template designed by HTML5 UP and released for free under the Creative Commons.",
        "buttonText": "Get started",
        "buttonPath": "#get-started",
        "imageSource": "https://source.unsplash.com/featured/?landscape,green,hills",
        "imagePosition": "right"
      }
    },
    {
      "name": "spotlight",
      "props": {
        "heading": "Spotlight",
        "text": "This is a Spotlight element, and it's generally used – as its name implies – to spotlight a particular feature, subject, or pretty much whatever. You can customize its style, scheme, color, orientation, content alignment, and image position, as well as assign it an optional onload or onscroll transition modifier (details).",
        "buttonText": "Learn more",
        "buttonPath": "#learn-more",
        "imageSource": "https://source.unsplash.com/featured/?girl,camera",
        "imagePosition": "left"
      }
    },
    {
      "name": "spotlight",
      "props": {
        "heading": "Spotlight",
        "text": "This is also a Spotlight element, and it's here because this demo would look a bit empty with just one spotlight. Like all spotlights, you can customize its style, scheme, color, orientation, content alignment, and image position, as well as assign it an optional onload or onscroll transition modifier (details).",
        "buttonText": "Learn more",
        "buttonPath": "#learn-more",
        "imageSource": "https://source.unsplash.com/featured/?fox,snow",
        "imagePosition": "right"
      }
    },
    {
      "name": "spotlight",
      "props": {
        "heading": "Spotlight",
        "text": "And yes, this is another Spotlight element, and it's also here because I need to fill a bit of space. Naturally, like any other spotlight, you can customize its style, scheme, color, orientation, content alignment, and image position, as well as assign it an optional onload or onscroll transition modifier (details).",
        "buttonText": "Learn more",
        "buttonPath": "#learn-more",
        "imageSource": "https://source.unsplash.com/featured/?city,sunset",
        "imagePosition": "left"
      }
    },
    {
      "name": "footer",
      "props": {
        "copyrightText": "© 2019"
      }
    }
  ]
}